Repository: neziw/plan_pm
Catalog: frontend/lib/l10n/app_*.arb
Languages: pl, uk

# stage1Button
source: Welcome to Plan PM
pl: Witaj w Plan PM
uk: Ласкаво просимо до Plan PM

# stage2Title
source: See all classes in a clear weekly schedule.
pl: Zobacz wszystkie zajęcia w przejrzystym planie tygodniowym.
uk: Перегляньте всі заняття у зручному тижневому розкладі.

# stage2Button
source: Next
pl: Dalej
uk: Далі

# stage3Title
source: Easily find your rooms with detailed location information.
pl: Znajdź swoje sale łatwo dzięki szczegółowym informacjom o lokalizacji.
uk: Легко знаходьте свої аудиторії завдяки детальній інформації про місцезнаходження.

# stage3Button
source: Next
pl: Dalej
uk: Далі

# stage4Title
source: Receive reminders before every class so you never miss them.
pl: Otrzymuj przypomnienia przed każdym zajęciami, żeby nigdy ich nie przegapić.
uk: Отримуйте нагадування перед кожним заняттям, щоб ніколи їх не пропустити.

# stage4Button
source: Start
pl: Rozpocznij
uk: Розпочати

# welcomePageSelectionText
source: Back to WelcomeScreen
pl: Powrót do WelcomeScreen
uk: Повернутися до WelcomeScreen

# inputPageSelectionText
source: Back to InputPage
pl: Powrót do InputPage
uk: Повернутися до InputPage

# inputPageLabel
source: Your Academic Data
pl: Twoje Dane Akademickie
uk: Ваші академічні дані

# facultyLabel
source: Faculty
pl: Wydział
uk: Факультет

# facultyHintText
source: Select faculty
pl: Wybierz wydział
uk: Виберіть факультет

# fieldLabel
source: Field of Study
pl: Kierunek studiów
uk: Напрямок навчання

# fieldHintText
source: Select field of study
pl: Wybierz kierunek studiów
uk: Виберіть напрямок навчання

# yearLabel
source: Current Year
pl: Aktualny Rok
uk: Поточний рік

# specialisationLabel
source: Specialization
pl: Specjalizacja
uk: Спеціалізація

# specialisationHintText
source: Select specialization
pl: Wybierz specjalizacje
uk: Виберіть спеціалізацію

# typeLabel
source: Study Mode
pl: Tryb studiów
uk: Форма навчання

# campusButton
source: Full-time
pl: Stacjonarne
uk: Стаціонарна

# extramuralButton
source: Part-time
pl: Zaoczne
uk: Заочна

# continueButton
source: Continue
pl: Kontynuuj
uk: Продовжити

# homePageLabel
source: Student data is:
pl: Dane studenta to:
uk: Дані студента:

# facultyText
source: Faculty
pl: Wydział
uk: Факультет

# fieldText
source: Field
pl: Kierunek
uk: Напрямок

# specialisationText
source: Specialization
pl: Specjalizacja
uk: Спеціалізація

# yearText
source: Year
pl: Rok
uk: Рік

# typeText
source: Study mode
pl: Tryb studiów
uk: Форма навчання

# dataNaN
source: No data
pl: Brak danych
uk: Немає даних

source: Study Settings
pl: Ustawienia studiów
uk: Налаштування навчання

# skipButton
source: Skip
pl: Pomiń
uk: Пропустити

# fullTimeStudy
source: Full-time
pl: Stacjonarne
uk: Стаціонарна

# partTimeStudy
source: Part-time
pl: Niestacjonarne
uk: Нестаціонарна

source: Group Selection
pl: Wybór grupy
uk: Вибір групи

# groupSelectionHint
source: Select your faculty, field, and mode to personalize your schedule
pl: Wybierz swój wydział, kierunek i tryb, aby spersonalizować plan zajęć
uk: Виберіть свій факультет, напрямок і форму, щоб персоналізувати розклад занять

# groupLoading
source: Loading groups...
pl: Ładowanie grup...
uk: Завантаження груп...

# groupSettings
source: Study Settings
pl: Ustawienia studiów
uk: Налаштування навчання

# groupSelectionHintAfterLoad
source: Based on your study settings, we have downloaded available groups. Select one or multiple to track several schedules.
pl: Na podstawie Twoich ustawień studiów pobraliśmy dostępne grupy. Wybierz jedną lub wiele, aby śledzić kilka planów.
uk: На основі ваших налаштувань навчання ми завантажили доступні групи. Виберіть одну або декілька, щоб відстежувати різні розклади.

source: Save
pl: Zapisz
uk: Зберегти

# todayDataNaN
source: No classes for today
pl: Brak zajęć na dziś
uk: Немає занять на сьогодні

# pageErrorMess
source: Error in FutureBuilder {snapshotError}
pl: Błąd w FutureBuilder {snapshotError}
uk: Помилка у FutureBuilder {snapshotError}

# lectureLength
source: {lecturesLength, plural, one{1 lecture} other{{lecturesLength} lectures}}
pl: {lecturesLength} zajęcia
uk: {lecturesLength, plural, one{1 заняття} few{{lecturesLength} заняття} many{{lecturesLength} занять} other{{lecturesLength} заняття}}

# recentLecture
source: Future classes
pl: Twoje najblizsze zajęcia
uk: Ваше найближче заняття

# lectureLoading
source: Loading schedule
pl: Ładowanie planu
uk: Завантаження розкладу

# todayLecturesNaN
source: No classes for today
pl: Brak zajęć na dziś
uk: Немає занять на сьогодні

# lectureWigetHint
source: You're up to date! Use your free time or review your schedule.
pl: Jesteś na bieżąco! Skorzystaj z wolnego czasu lub przejrzyj swój harmonogram.
uk: Ви в курсі! Скористайтеся вільним часом або перегляньте свій розклад.

# daysShortMon
source: Mon
pl: Pon
uk: Пн

# daysShortTue
source: Tue
pl: Wt
uk: Вт

# daysShortWed
source: Wed
pl: Śr
uk: Ср

# daysShortThu
source: Thu
pl: Czw
uk: Чт

# daysShortFri
source: Fri
pl: Pt
uk: Пт

# daysMon
source: monday
pl: poniedziałek
uk: понеділок

# daysTue
source: tuesday
pl: wtorek
uk: вівторок

# daysWed
source: wednesday
pl: środa
uk: середа

# daysThu
source: thursday
pl: czwartek
uk: четвер

# daysFri
source: friday
pl: piątek
uk: п'ятниця

# selectedGroupsHeader
source: Selected Groups
pl: Wybrane grupy
uk: Вибрані групи

# changeGroupsButton
source: Change Groups
pl: Zmień grupy
uk: Змінити групи

# selectedGroupsLabel
source: Selected Groups
pl: Wybrane grupy
uk: Вибрані групи

source: No data available
pl: Brak danych
uk: Дані недоступні

# academicInfoHeader
source: Academic Information
pl: Informacje akademickie
uk: Академічна інформація

# editButton
source: Edit
pl: Edytuj
uk: Редагувати

# studyYear
source: {year, plural, one{1 year} other{{year} years}}
pl: {year, plural, one{1 rok} few{{year} lata} many{{year} lat} other{{year} roku}}
uk: {year, plural, one{1 рік} few{{year} роки} many{{year} років} other{{year} року}}

# studyModeLabel
source: Study Mode
pl: Tryb studiów
uk: Форма навчання

# groupTypeAuditorium
source: Auditorium
pl: Audytorium
uk: Аудиторія

# groupTypeClasses
source: Classes
pl: Ćwiczenia
uk: Практичні заняття

# groupTypeLabs
source: Laboratories
pl: Laboratoria
uk: Лабораторні роботи

# groupTypeOther
source: Other
pl: Inne
uk: Інше

# pageTitleHome
source: Home
pl: Strona główna
uk: Головна

# pageTitleLectures
source: Classes
pl: Zajęcia
uk: Заняття

# debugHeader
source: Debug
uk: Налагодження

# returnToLabel
source: Return to
pl: Powrót do
uk: Повернутися до

# welcomeScreenButton
source: Welcome screen
uk: Екран привітання

# inputPageButton
source: Input page
uk: Екран вводу даних
